Public Attributes | List of all members
API_DimensionType Struct Reference
Element Manager API
Describes a (linear) dimension. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
short  | linPen
Pen attribute index of dimension and witness lines.
API_TextPosID  | textPos
Dimension text position (see API_TextPosID).
API_DirID  | textWay
The position of the text relative to the dimension line (see API_DirID). The possible values are: @ref APIDir_Parallel, APIDir_Horizontal, APIDir_Vertical, APIDir_ArcDim.
API_AppearID  | dimAppear
Appearance of the dimension (see API_AppearID).
bool  | detailedHoleDim
Detailed door/window dimension.
char  | nominalHoleDim
Nominal height for door/window dimension.
char  | compAutoThick
Dimension type bits of composite walls (totalBit = 1; coreBit = 2; refLineBit = 4; manualBit = 16;).
bool  | defStaticDim
Static dimension (default)?
API_WitnessID  | defWitnessForm
Default witness line format (see API_WitnessID).
double  | defWitnessVal
Default gap (APIWtn_Fix) or length (APIWtn_Large) of witness line according todefWitnessForm.
API_NoteType  | defNote
Default note parameters (see API_NoteType).
API_MarkerData  | markerData
Marker specification (see API_MarkerData).
char  | ed_dimForm
Elevation dimension marker type.
char  | ed_arrowAng
Elevation dimension half-arrow angle:
bool  | ed_arrowFill
Elevation dimension arrow is filled or not.
bool  | ed_arrowUp
Elevation dimension arrow is up/down.
bool  | ed_needPlus
Elevation dimension plus sign needed for positive numbers.
bool  | usedIn3D
Used for dimensioning 3D points.
bool  | horizontalText
Dimension texts are horizontal.
bool  | onlyDimensionText
Only dimension texts (notes) are visible — no leader line.
API_DimOriginID  | ed_origin
Elevation dimension origin.
API_CircleLevelDimensionFillID  | ed_circleLevelDimensionFill
Elevation dimension: the circle style marker fill.
API_Coord  | refC
Dimension line location.
API_Vector  | direction
Direction of the dimension line if parallel.
API_DimBase  | arcBase
Neig unique ID of the base element for an arc dimension chain.
Int32  | nDimElem
Number of segments in dimension elements' chain (see API_ElementMemo)
API_Coord3D  | refC3D
Position of the dimension chain (used only in 3D).
API_Vector3D  | direction3D
Direction of the dimension line (used only in 3D).
API_Vector3D  | normVect3D
Dimension plane's normal vector (used only in 3D).
API_DimLayoutID  | dimLayout
Layouting algorithm used by the dimension.
bool  | pushNeighborEnabled
Enable a note to push its neighbours (In case of API_Flexible layouting algorithm).
bool  | placeUnderEnabled
Try to place a note under the dimension line (In case of API_Flexible layouting algorithm).
bool  | advanced
Use advanced logic (In case of API_Centered layouting algorithm).
bool  | clipOtherSide
No witness line part on the other side (opposite to basepoint).
API_DimTextFillOrderID  | textFillOrder
Drawing order of the text's fill and contour relative to the dimension line.
Detailed Description
Describes a (linear) dimension.
Since
Archicad 26
Remarks
For dimension related memo data see the ACAPI_Element_GetMemo function.
Member Data Documentation
◆ advanced
 API_DimensionType::advanced
Use advanced logic (In case of API_Centered layouting algorithm).
◆ arcBase
 API_DimensionType::arcBase
Neig unique ID of the base element for an arc dimension chain.
◆ clipOtherSide
 API_DimensionType::clipOtherSide
No witness line part on the other side (opposite to basepoint).
◆ compAutoThick
 API_DimensionType::compAutoThick
Dimension type bits of composite walls (totalBit = 1; coreBit = 2; refLineBit = 4; manualBit = 16;).
◆ defNote
 API_DimensionType::defNote
Default note parameters (see API_NoteType).
◆ defStaticDim
 API_DimensionType::defStaticDim
Static dimension (default)?
◆ defWitnessForm
 API_DimensionType::defWitnessForm
Default witness line format (see API_WitnessID).
◆ defWitnessVal
 API_DimensionType::defWitnessVal
Default gap (APIWtn_Fix) or length (APIWtn_Large) of witness line according todefWitnessForm.
◆ detailedHoleDim
 API_DimensionType::detailedHoleDim
Detailed door/window dimension.
◆ dimAppear
 API_DimensionType::dimAppear
Appearance of the dimension (see API_AppearID).
◆ dimLayout
 API_DimensionType::dimLayout
Layouting algorithm used by the dimension.
◆ direction
 API_DimensionType::direction
Direction of the dimension line if parallel.
◆ direction3D
 API_DimensionType::direction3D
Direction of the dimension line (used only in 3D).
◆ ed_arrowAng
 API_DimensionType::ed_arrowAng
Elevation dimension half-arrow angle:
 Value  | Degree
 0  | 30 degrees
 1  | 45 degrees
 2  | 60 degrees
◆ ed_arrowFill
 API_DimensionType::ed_arrowFill
Elevation dimension arrow is filled or not.
◆ ed_arrowUp
 API_DimensionType::ed_arrowUp
Elevation dimension arrow is up/down.
◆ ed_circleLevelDimensionFill
 API_DimensionType::ed_circleLevelDimensionFill
Elevation dimension: the circle style marker fill.
◆ ed_dimForm
 API_DimensionType::ed_dimForm
Elevation dimension marker type.
◆ ed_needPlus
 API_DimensionType::ed_needPlus
Elevation dimension plus sign needed for positive numbers.
◆ ed_origin
 API_DimensionType::ed_origin
Elevation dimension origin.
◆ head
 API_DimensionType::head
General element header.
◆ horizontalText
 API_DimensionType::horizontalText
Dimension texts are horizontal.
◆ linPen
 API_DimensionType::linPen
Pen attribute index of dimension and witness lines.
◆ markerData
 API_DimensionType::markerData
Marker specification (see API_MarkerData).
◆ nDimElem
 API_DimensionType::nDimElem
Number of segments in dimension elements' chain (see API_ElementMemo)
◆ nominalHoleDim
 API_DimensionType::nominalHoleDim
Nominal height for door/window dimension.
◆ normVect3D
 API_DimensionType::normVect3D
Dimension plane's normal vector (used only in 3D).
◆ onlyDimensionText
 API_DimensionType::onlyDimensionText
Only dimension texts (notes) are visible — no leader line.
◆ placeUnderEnabled
 API_DimensionType::placeUnderEnabled
Try to place a note under the dimension line (In case of API_Flexible layouting algorithm).
◆ pushNeighborEnabled
 API_DimensionType::pushNeighborEnabled
Enable a note to push its neighbours (In case of API_Flexible layouting algorithm).
◆ refC
 API_DimensionType::refC
Dimension line location.
◆ refC3D
 API_DimensionType::refC3D
Position of the dimension chain (used only in 3D).
◆ textFillOrder
 API_DimensionType::textFillOrder
Drawing order of the text's fill and contour relative to the dimension line.
◆ textPos
 API_DimensionType::textPos
Dimension text position (see API_TextPosID).
◆ textWay
 API_DimensionType::textWay
The position of the text relative to the dimension line (see API_DirID). The possible values are: @ref APIDir_Parallel, APIDir_Horizontal, APIDir_Vertical, APIDir_ArcDim.
◆ usedIn3D
 API_DimensionType::usedIn3D
Used for dimensioning 3D points.